


import PropTypes from 'prop-types'
import React, { Component } from 'react'

export default class ProductArticle extends Component {

  render() {
    return (
      <div data-testid='ProductArticle'>


        <h4 className='product-article-header'>بررسی تخصصی</h4>


<p>غول جدید سامسونگ قدرتمند‌تر از همیشه


شاید در نگاه اول به سامسونگ Galaxy S23 Ultra تفاوتی با Galaxy S22 Ultra دیده نشود و سامسونگ به طراحی برنده خود دست نزده است. اما باید بدانید که این بار این گوشی هوشمند با کوله‌باری از تجربه و برطرف کردن مشکلات هرچند اندک گذشته وارد میدان رقابت با پرچمداران قدرتمند برند‌های دیگر شده و با لیاقت تمام همجون یک پرچمدار مقتدر، عملکرد درخشانی داشته است. شاید ظاهر این گوشی چندان تفاوتی با نسل قبلی نداشته باشد، اما فریم‌ها حالت خمیدگی کمتری دارند و حس و حال استفاده فریم تخت و جذابی را به شما می‌دهند. البته فریم‌های آلومینیومی این گوشی آنقدر تخت نیست که در استفاده طولانی مدت مشکلی برای دست به‌همراه داشته باشد. سامسونگ تلاش داشته تا از متریال بازیافت‌ پذیر برای این گوشی استفاده کند و می‌توانیم بگوییم در این زمینه به نسبت تمام پرچمداران دیگر عملکرد بسیار بهتری داشته است.


نمای رو‌به‌رویی این گوشی صفحه‌نمایش بسیار گسترده‌ای را ارائه کرده است که تقریبا حاشیه‌های صفحه‌نمایش اصلا به چشم نمی‌آیند و همین امر سبب شده تا ۸۹.۹ درصد از نمای رو‌به‌رویی را به خودش اختصاص دهد. طراحی نمایش پشتی هم تفاوت چندانی با نسل قبلی ندارد، تنها رینگ‌های در نظر گرفته شده برای سنسور‌های دوربین بیش از پیش خودنمایی می‌کنند و سعی دارند تا قدرت بالای سنسور‌های دوربین را به رخ بکشند. وزن ۲۳۴ گرمی این گوشی قطعا وزن سبکی نیست و در استفاده طولانی مدت دست را خسته می‌کند. اما همین وزن سبب شده تا احساس افتادن در حین استفاده تا میزان بسیار زیادی کاهش پیدا کند و کاملا حس و حال استفاده از یک گوشی پرچمدار با اصالت را به شما می‌دهد. البته نباید فراموش کنیم که این گوشی در برابر آب هم مقاوم بوده و پشتیبانی از استاندارد IP68 سبب شده تا توانایی قرار‌گیری در عمق ۱.۵ متری آب و مدت زمان ۳۰ دقیقه را داشته باشد.</p>



      </div>
    )
  }
}
